accstarkam.ОбменМагистральБП/src/InformationRegisters/МС_НаименованиеНоменклатуры/МС_НаименованиеНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_НаименованиеНоменклатуры</name>
  <resources>
    <name>Наименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

accstarkam.ОбменМагистральБП/src/InformationRegisters/МС_ОчередьВыгрузки/МС_ОчередьВыгрузки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_ОчередьВыгрузки</name>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

accstarkam.ОбменМагистральБП/src/InformationRegisters/МС_СоответствиеОбъектовДляОбмена/МС_СоответствиеОбъектовДляОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МС_СоответствиеОбъектовДляОбмена</name>
  <resources>
    <name>ИмяТипаПриемника</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>СобственнаяСсылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СсылкаВДругойИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

accstarkam.ОбменМагистральБП/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bb44a57a-ce46-4995-a057-b7b6c4ccc2e5">
  <name>СтавкиНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="f0fa334c-59dc-4b6c-b81c-1bbad6b45917">
    <name>НДС22</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="ca0cf7c1-ce04-4fe1-9fe5-0f0e1099a0ff">
    <name>НДС18</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="76f269ef-8d75-4355-955b-0d83af4b6513">
    <name>НДС18_118</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="2567b477-58ec-4a0b-9a24-fbb80983c5a7">
    <name>НДС10</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="be1ca97f-f42c-40f1-a0f8-786f02ce1174">
    <name>НДС10_110</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="92f1bd28-d028-4c77-8678-600da9b8a9a5">
    <name>НДС0</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="df613792-69af-43d1-ad77-47226fbc178c">
    <name>БезНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="45974ccb-45ed-4235-b8ff-abc37bb5c45b">
    <name>НДС20</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="6cf8ca3a-63dd-4385-ba30-38011e461f36">
    <name>НДС20_120</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="b9e148ea-d7b7-4295-8b0a-52c32dba3de9">
    <name>НДС5</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="fd01d596-2c9d-4ea0-9473-d151dc6d0656">
    <name>НДС5_105</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="afbae5cd-5d55-4639-b461-c68d385ec5fb">
    <name>НДС7</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="89643718-2e98-4667-bb58-9476b4a8bfab">
    <name>НДС7_107</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="f0456ccc-4e50-4999-b74b-8ac9c206b7f4">
    <name>НДС22_122</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

accstarkam.ОбменМагистральБП/src/Enums/СпособыЗачетаАвансов/СпособыЗачетаАвансов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="4bd467ec-bda2-4892-88fe-81b6bd2acdf3">
  <name>СпособыЗачетаАвансов</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="e23f9964-6487-4a73-af8e-d5ea01b5ffb9">
    <name>НеЗачитывать</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

accstarkam.ОбменМагистральБП/src/CommonModules/МС_МодульОбменаВызовСервера/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура МС_ПриЗаписиНоменклатурыПриЗаписи(Источник, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	СсылкаНаОбъект = Источник.Ссылка;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СпрНоменклатура.Ссылка КАК Ссылка,
		|	СпрНоменклатура.Наименование КАК НовоеНаименование,
		|	СпрНоменклатура.НаименованиеПолное КАК НовоеНаименованиеПолное,
		|	ЕСТЬNULL(АктуальноеНаименование.Наименование, &ПустаяСтрока) КАК Наименование,
		|	ЕСТЬNULL(АктуальноеНаименование.НаименованиеПолное, &ПустаяСтрока) КАК НаименованиеПолное
		|ИЗ
		|	Справочник.Номенклатура КАК СпрНоменклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.МС_НаименованиеНоменклатуры КАК АктуальноеНаименование
		|		ПО СпрНоменклатура.Ссылка = АктуальноеНаименование.Номенклатура
		|ГДЕ
		|	СпрНоменклатура.Ссылка = &Ссылка";

	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ПустаяСтрока", "");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.Наименование <> Выборка.НовоеНаименование 
		Или Выборка.НаименованиеПолное <> Выборка.НовоеНаименованиеПолное Тогда
			
			АктуализироватьРегистрНаименованиеНоменклатуры(Выборка);
			
			ОтправитьНоменклатуруВОчередьНаВыгрузку(Выборка.Ссылка);
			
			ФоновыеЗадания.Выполнить(
				"МС_МодульОбменаВызовСервера.ВыгрузитьОчередьНоменклатуры",
				Новый Массив //ТОDО: Нужны параметны или нет
			);
	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыгрузитьОчередьНоменклатуры() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	МС_ОчередьВыгрузки.Ссылка КАК Ссылка
		|ИЗ
		|	РегистрСведений.МС_ОчередьВыгрузки КАК МС_ОчередьВыгрузки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивНоменклатуры = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивНоменклатуры.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	СтрокаJSON = СформироватьJSONПоМассивуСсылок(МассивНоменклатуры);
	
	Если ОтправитьJSONВДругуюБазу(СтрокаJSON) = 200 Тогда
	
		УдалитьНоменклатуруИзОчереди(МассивНоменклатуры);
	
	
	КонецЕсли;
	
	 
	
КонецПроцедуры

Процедура ВыгрузитьВсюНоменклатуру() Экспорт
	СтрокаJSON = СформироватьJSONПоВсейНоменклатуре();
	ОтправитьJSONВДругуюБазу(СтрокаJSON);
КонецПроцедуры

Функция ХешSHA256Строки(ИсходнаяСтрока) Экспорт
	
	Хеширование = Новый ХешированиеДанных(ХешФункция.SHA256);
	Хеширование.Добавить(ИсходнаяСтрока);
	ХешСумма = Хеширование.ХешСумма;
	
	Возврат Base64Строка(ХешСумма);
	
КонецФункции

Функция ПараметрыПодключения() Экспорт

	УстановитьПривилегированныйРежим(Истина);
	ПараметрыПодключения = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
		"ПараметрыПодключенияМагистральСтаркам");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат ПараметрыПодключения;
	
КонецФункции

Процедура ПолучитьПакетыССервера() Экспорт

	ПараметрыПодключения = ПараметрыПодключения();
	Если ПараметрыПодключения = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Не заполнены параметры подключения к серверу обмена Магистраль-Старкам";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	ПараметрыПодключения.Вставить("ПутьСервиса", "api/packets/next");
	Для Н = 0 По 100000 Цикл
		Результат = ПолучитьПакетHTTPS(ПараметрыПодключения);
		Если Результат.КодОтвета = 200 Тогда
			ОтчетОЗагрузки = ЗагрузитьДанные(Результат.ТелоОтвета);
			Если ОтчетОЗагрузки.success Тогда
				ПараметрыПодключения.Вставить("ПутьСервисаПодтверждения", СтрШаблон("api/packets/MS/%1/ack",
					ОтчетОЗагрузки.packet_number));
				ПакетУспешноЗагруженHTTPS(ПараметрыПодключения);
			КонецЕсли;
		Иначе
			Прервать;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры


#Область ЧтениеЗаписьJSON

Функция ПрочитатьJSONИзСтроки(JSONСтрока) Экспорт

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(JSONСтрока);

	Результат = ПрочитатьJSON(ЧтениеJSON);

	ЧтениеJSON.Закрыть();

	Возврат Результат;

КонецФункции

Функция ЗаписатьДанныеВJSON(Данные) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, Данные);

	СтрокаJSON = ЗаписьJSON.Закрыть();

	Возврат СтрокаJSON;

КонецФункции
#КонецОбласти

Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки) Экспорт
	ЗаписьЖурналаРегистрации("ОбменМагистральСтаркам", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПакетУспешноЗагруженHTTPS(ПараметрыПодключения)

	HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера, 443, , , Новый ИнтернетПрокси(Ложь), 30,
		Новый ЗащищенноеСоединениеOpenSSL);

	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыПодключения.ПутьСервисаПодтверждения);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("X-Base-ID", ПараметрыПодключения.ИДБазы);
	HTTPЗапрос.Заголовки.Вставить("X-API-Key", ПараметрыПодключения.APIkey);

	Попытка
		HTTPСоединение.ВызватьHTTPМетод("POST", HTTPЗапрос);
	Исключение

		ТекстОшибки = СтрШаблон("Ошибка отправки запроса на удаление пакета с сервера: %1
								|%2", ОписаниеОшибки(), ПараметрыПодключения.ПутьСервисаПодтверждения);

		ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки);

	КонецПопытки;

КонецПроцедуры
			
#Область ЗагрузкаДанных

Функция ЗагрузитьДанные(JSONСтрока)

	СтруктураДанных = ПрочитатьJSONИзСтроки(JSONСтрока);
	Данные = СтруктураДанных.payload;
	
	Результат = Новый Структура;
	Результат.Вставить("success", Ложь);
	
	НачатьТранзакцию();
	Попытка

		ЗаблокироватьЗагрузкуПоGUID(Данные.guid);
		Если Данные.source = "ПриходнаяНакладная" Тогда
			Результат = СоздатьПоступлениеТоваровУслугИзРозницы(Данные);
		ИначеЕсли Данные.source = "СчетНаОплатуПоставщика" Тогда
			Результат = СоздатьСчетНаОплатуПоставщикаИзРозницы(Данные);
		КонецЕсли;

		ЗафиксироватьТранзакцию();

	Исключение

		ОтменитьТранзакцию();
		//ВызватьИсключение;

	КонецПопытки;
	
	Результат.Вставить("packet_number", СтруктураДанных.packet_number);
	
	Возврат Результат;

КонецФункции

Функция ЭтоНезаполненнаяСтрока(Знач Значение)
	Если Значение = Неопределено Или Значение = Null Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат ПустаяСтрока(СокрЛП(Строка(Значение)));
КонецФункции

Функция ЗначениеСвойства(Данные, ИмяСвойства, ЗначениеПоУмолчанию = Неопределено)
	Если Данные = Неопределено Или Данные = Null Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		Возврат ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Если Данные.Свойство(ИмяСвойства) Тогда
		Возврат Данные[ИмяСвойства];
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция ПроверитьВходящийJSON(Данные, СообщениеОбОшибке)
	
	СообщениеОбОшибке = "";
	
	Если ТипЗнч(Данные) <> Тип("Структура") Тогда
		СообщениеОбОшибке = "Ожидается JSON-объект верхнего уровня.";
		Возврат Ложь;
	КонецЕсли;
	
	GUIDДокументаИсточник = ЗначениеСвойства(Данные, "guid", "");
	Если ЭтоНезаполненнаяСтрока(GUIDДокументаИсточник) Тогда
		СообщениеОбОшибке = "Не заполнено поле guid.";
		Возврат Ложь;
	КонецЕсли;
	
	Организация = ЗначениеСвойства(Данные, "organization", Неопределено);
	Если ТипЗнч(Организация) <> Тип("Структура") Тогда
		СообщениеОбОшибке = "Не заполнено поле organization.";
		Возврат Ложь;
	КонецЕсли;
	
	Товары = ЗначениеСвойства(Данные, "items", Неопределено);
	Если ТипЗнч(Товары) <> Тип("Массив") Тогда
		СообщениеОбОшибке = "Не заполнено поле items (ожидается массив).";
		Возврат Ложь;
	КонецЕсли;
	
	Если Товары.Количество() = 0 Тогда
		СообщениеОбОшибке = "Поле items пустое.";
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции


Процедура ЗаблокироватьЗагрузкуПоGUID(Знач GUIDДокумента)
	
	БлокировкаДанных = Новый БлокировкаДанных;
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрСведений.МС_СоответствиеОбъектовДляОбмена");
	ЭлементБлокировкиДанных.УстановитьЗначение("СсылкаВДругойИБ", GUIDДокумента);
	ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"МС_ОбменРозницаБП",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			"Ошибка блокировки загрузки по GUID=" + Строка(GUIDДокумента) + ": " + ОписаниеОшибки()
		);
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

Функция ДатаИзСтрокиJSON(Знач ЗначениеJSON) 
	
	Если ЗначениеJSON = Неопределено Или ЗначениеJSON = Null Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(ЗначениеJSON) = Тип("Дата") Тогда
		Возврат ЗначениеJSON;
	КонецЕсли;
	
	СтрокаДаты = СокрЛП(Строка(ЗначениеJSON));
	
	Если ПустаяСтрока(СтрокаДаты) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат XMLЗначение(Тип("Дата"), СтрокаДаты);

КонецФункции

Функция ПолучитьПустуюСсылкуПоТипу(ТипСсылки) 
	
	ИмяТипа = Строка(ТипСсылки);
	
	Если СтрНачинаетсяС(ИмяТипа, "СправочникСсылка.") Тогда
		ИмяОбъекта = СтрЗаменить(ИмяТипа, "СправочникСсылка.", "");
		Возврат Справочники[ИмяОбъекта].ПустаяСсылка();
	КонецЕсли;
	
	Если СтрНачинаетсяС(ИмяТипа, "ДокументСсылка.") Тогда
		ИмяОбъекта = СтрЗаменить(ИмяТипа, "ДокументСсылка.", "");
		Возврат Документы[ИмяОбъекта].ПустаяСсылка();
	КонецЕсли;
	
	ВызватьИсключение "Неподдерживаемый тип ссылки: " + ИмяТипа;
	
КонецФункции

Функция СоздатьНовыйОбъектПоТипу(ТипСсылки) 
	
	ИмяТипа = Строка(ТипСсылки);
	
	Если СтрНачинаетсяС(ИмяТипа, "СправочникСсылка.") Тогда
		ИмяОбъекта = СтрЗаменить(ИмяТипа, "СправочникСсылка.", "");
		Возврат Справочники[ИмяОбъекта].СоздатьЭлемент();
	КонецЕсли;
	
	Если СтрНачинаетсяС(ИмяТипа, "ДокументСсылка.") Тогда
		ИмяОбъекта = СтрЗаменить(ИмяТипа, "ДокументСсылка.", "");
		Возврат Документы[ИмяОбъекта].СоздатьДокумент();
	КонецЕсли;
	
	ВызватьИсключение "Неподдерживаемый тип ссылки: " + ИмяТипа;
	
КонецФункции

Функция НайтиПоСсылкеВДругойБазе(СсылкаВДругойИБ, ИмяТипаПриемника)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МС_СоответствиеОбъектовДляОбмена.СобственнаяСсылка КАК СобственнаяСсылка
	|ИЗ
	|	РегистрСведений.МС_СоответствиеОбъектовДляОбмена КАК МС_СоответствиеОбъектовДляОбмена
	|ГДЕ
	|	МС_СоответствиеОбъектовДляОбмена.СсылкаВДругойИБ = &СсылкаВДругойИБ
	|	И МС_СоответствиеОбъектовДляОбмена.ИмяТипаПриемника = &ИмяТипаПриемника";
	
	Запрос.УстановитьПараметр("СсылкаВДругойИБ", СсылкаВДругойИБ);
	Запрос.УстановитьПараметр("ИмяТипаПриемника", ИмяТипаПриемника);
		
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.СобственнаяСсылка;
	КонецЕсли;
	
	Возврат ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника);
	
КонецФункции 

Функция НайтиПоИННКПП(ИНН, КПП, ИмяТипа)
    	
	ИНН = СокрЛП(ИНН);
	КПП = СокрЛП(КПП);
	
	ИмяОбъекта = СтрЗаменить(ИмяТипа, "СправочникСсылка.", "");
	
	Если ПустаяСтрока(ИНН) Тогда
		Возврат Справочники[ИмяОбъекта].ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Организации.Ссылка КАК Ссылка,
	|	Организации.ИНН КАК ИНН,
	|	Организации.КПП КАК КПП,
	|	ВЫБОР
	|		КОГДА Организации.КПП = &КПП
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Приоритет
	|ИЗ
	|	Справочник." + ИмяОбъекта + " КАК Организации
	|ГДЕ
	|	Организации.ПометкаУдаления = ЛОЖЬ
	|	И Организации.ИНН = &ИНН
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет";
	
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Справочники[ИмяОбъекта].ПустаяСсылка();

КонецФункции 

Функция НайтиОрганизацию(Данные)
	
	ИмяТипаПриемника = "СправочникСсылка.Организации";
	Организация = НайтиПоСсылкеВДругойБазе(Данные.guid, ИмяТипаПриемника);
	Если Организация = ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника) Тогда
		Организация = НайтиПоИННКПП(Данные.inn, Данные.kpp, ИмяТипаПриемника);
		ЗаписатьВРегистрСоответствияОбъектов(Организация, Данные.guid, ИмяТипаПриемника);
	КонецЕсли;
	
	Возврат Организация;	
	
КонецФункции

Функция НайтиКонтрагента(Данные)
	
	ИмяТипаПриемника = "СправочникСсылка.Контрагенты";
	Контрагент = НайтиПоСсылкеВДругойБазе(Данные.guid, ИмяТипаПриемника);
	Если Контрагент = ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника) Тогда
		Контрагент = НайтиПоИННКПП(Данные.inn, Данные.kpp, ИмяТипаПриемника);
		ЗаписатьВРегистрСоответствияОбъектов(Контрагент, Данные.guid, ИмяТипаПриемника);
	КонецЕсли; 
	
	Возврат Контрагент;
	
КонецФункции 

Функция НайтиСклад(ДанныеСклада)
	//Склад.Вставить("guid", ГУИД(ДокументСсылка.СтруктурнаяЕдиница));
	//Склад.Вставить("name", ДокументСсылка.СтруктурнаяЕдиница.Наименование);
	
	СкладПоУмолчанию = Константы.МС_СкладПоУмолчаниюДляЗагрузкиИзРозницы.Получить();
	Если ЗначениеЗаполнено(СкладПоУмолчанию) Тогда
		Возврат СкладПоУмолчанию;
	КонецЕсли;
	
	Возврат XMLЗначение(Тип("СправочникСсылка.Склады"), "f2bbcd91-6b13-11e4-8756-000c29b3b732"); // fallback, Склад ЦМС
	
КонецФункции // ()

Процедура ЗаполнитьДоговор(ДокументОбъект)

	МассивВидовДоговоров = РаботаСДоговорамиКонтрагентовБПВызовСервера.ВидыДоговоровДокумента(
		Перечисления.ВидыОперацийПоступлениеТоваровУслуг.Товары, ); //ДокументОбъект.ВидОперации//Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
	
	РаботаСДоговорамиКонтрагентовБП.УстановитьДоговорКонтрагента(ДокументОбъект.ДоговорКонтрагента,
	ДокументОбъект.Контрагент, ДокументОбъект.Организация, МассивВидовДоговоров);	
	
КонецПроцедуры

Функция НайтиНоменклатуру(Данные)
	Если ЗначениеЗаполнено(Данные.guid_bp) Тогда
		Попытка
			Возврат XMLЗначение(Тип("СправочникСсылка.Номенклатура"), Данные.guid_bp)
		Исключение      
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
				"МС_ОбменРозницаБП",
				УровеньЖурналаРегистрации.Ошибка,
				,
				,
				"Ошибка поиска номенклатуры по guid_bp=" + Строка(Данные.guid_bp) + ": " + ОписаниеОшибки()
			);
		КонецПопытки
	КонецЕсли;
	
	Возврат Справочники.Номенклатура.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьСтавкуНДС(СтавкаНДССтрока)
	Если СтавкаНДССтрока = "22%" Тогда
		Возврат Перечисления.СтавкиНДС.НДС22;
	ИначеЕсли СтавкаНДССтрока = "22% / 122%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС22_122;
	ИначеЕсли СтавкаНДССтрока = "5%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС5;
	ИначеЕсли СтавкаНДССтрока = "5% / 105%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС5_105;
	ИначеЕсли СтавкаНДССтрока = "20%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС20;
	ИначеЕсли СтавкаНДССтрока = "18%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС18;
	ИначеЕсли СтавкаНДССтрока = "18% / 118%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС18_118;
	ИначеЕсли СтавкаНДССтрока = "10%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС10;
	ИначеЕсли СтавкаНДССтрока = "10% / 110%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС10_110;
	ИначеЕсли СтавкаНДССтрока = "0%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС0;
	ИначеЕсли СтавкаНДССтрока = "Без НДС" Тогда	
		Возврат Перечисления.СтавкиНДС.БезНДС;
	ИначеЕсли СтавкаНДССтрока = "7%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС7;
	ИначеЕсли СтавкаНДССтрока = "7% / 107%" Тогда	
		Возврат Перечисления.СтавкиНДС.НДС7_107;
	Иначе
		Возврат Перечисления.СтавкиНДС.БезНДС;
	КонецЕсли;
КонецФункции

Процедура ЗаполнитьТабличнуюЧастьТовары(Товары, Данные)
	Товары.Очистить();
	
	Для каждого СтрокаТЧ Из Данные Цикл 
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = НайтиНоменклатуру(СтрокаТЧ.Nomenclature);
		НоваяСтрока.Количество = СтрокаТЧ.quantity;
		НоваяСтрока.Цена = СтрокаТЧ.price;
		НоваяСтрока.Сумма = СтрокаТЧ.amount;
		НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТЧ.vat_rate);
		НоваяСтрока.СуммаНДС = СтрокаТЧ.vat_amount;
		
		НоваяСтрока.СтранаПроисхождения = НоваяСтрока.Номенклатура.СтранаПроисхождения;

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьТоварыСчетНаОплатуПоставщика(Товары, Данные)
	Товары.Очистить();
	
	Для каждого СтрокаТЧ Из Данные Цикл 
		
		НоваяСтрока = Товары.Добавить();
		НоваяСтрока.Номенклатура = НайтиНоменклатуру(СтрокаТЧ.Nomenclature);
		НоваяСтрока.Количество = СтрокаТЧ.quantity;
		НоваяСтрока.Цена = СтрокаТЧ.price;
		НоваяСтрока.Сумма = СтрокаТЧ.amount;
		НоваяСтрока.СтавкаНДС = ПолучитьСтавкуНДС(СтрокаТЧ.vat_rate);
		НоваяСтрока.СуммаНДС = СтрокаТЧ.vat_amount;

	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьДокументДаннымиИзРозницы(ДокументОбъект, Данные)
	
	ДокументОбъект.Организация	= НайтиОрганизацию(Данные.organization);
	ДокументОбъект.Контрагент	= НайтиКонтрагента(Данные.Counterparty);
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, , Истина);
	
	ЗаполнитьДоговор(ДокументОбъект);
	
	ДокументОбъект.Дата = ДатаИзСтрокиJSON(Данные.date); 
	ДокументОбъект.ДатаВходящегоДокумента = ДатаИзСтрокиJSON(Данные.incoming_date); 
	ДокументОбъект.Склад = НайтиСклад(Данные.warehouse);
	ДокументОбъект.НомерВходящегоДокумента = Данные.incoming_number;
	ДокументОбъект.Комментарий = Данные.comment;	
	ДокументОбъект.ЭтоУниверсальныйДокумент = Данные.is_upd;
	ДокументОбъект.СуммаВключаетНДС = Данные.amount_includes_vat;
	ДокументОбъект.СуммаДокумента = Данные.total_amount;
	ДокументОбъект.ЕстьМаркируемаяПродукцияГИСМ = Данные.GISM;
	ДокументОбъект.СпособЗачетаАвансов = Перечисления.СпособыЗачетаАвансов.НеЗачитывать;
	
	ЗаполнитьТабличнуюЧастьТовары(ДокументОбъект.Товары, Данные.items);
	
КонецПроцедуры

Процедура ЗаполнитьСчетНаОплатуПоставщикаДаннымиИзРозницы(ДокументОбъект, Данные)
	
	ДокументОбъект.Организация	= НайтиОрганизацию(Данные.organization);
	ДокументОбъект.Контрагент	= НайтиКонтрагента(Данные.Counterparty);
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект);
	
	ЗаполнитьДоговор(ДокументОбъект);
	
	ДокументОбъект.Дата = ДатаИзСтрокиJSON(Данные.date); 
	ДокументОбъект.ДатаВходящегоДокумента = ДатаИзСтрокиJSON(Данные.incoming_date); 
	ДокументОбъект.НомерВходящегоДокумента = Данные.incoming_number;
	ДокументОбъект.Комментарий = Данные.comment;	
	ДокументОбъект.СуммаВключаетНДС = Данные.amount_includes_vat;
	ДокументОбъект.СуммаДокумента = Данные.total_amount;
	
	ЗаполнитьТабличнуюЧастьТоварыСчетНаОплатуПоставщика(ДокументОбъект.Товары, Данные.items);
	
КонецПроцедуры

Процедура ЗаписатьВРегистрСоответствияОбъектов(СобственнаяСсылка, СсылкаВДругойИБ, ИмяТипаПриемника)
	Если ЗначениеЗаполнено(СобственнаяСсылка) Тогда
		Запись = РегистрыСведений.МС_СоответствиеОбъектовДляОбмена.СоздатьМенеджерЗаписи();
		Запись.СобственнаяСсылка = СобственнаяСсылка;
		Запись.СсылкаВДругойИБ = СсылкаВДругойИБ;
		Запись.ИмяТипаПриемника = ИмяТипаПриемника;
		Запись.Записать(Истина);
	КонецЕсли;
КонецПроцедуры

Функция СоздатьПоступлениеТоваровУслугИзРозницы(Данные)
	ИмяТипаПриемника = "ДокументСсылка.ПоступлениеТоваровУслуг";
	ДокументСсылка = НайтиПоСсылкеВДругойБазе(Данные.guid, ИмяТипаПриемника);
	ДобавитьВСоответствиеОбъектов = Ложь;
	
	Если ДокументСсылка = ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника) Тогда
		ДобавитьВСоответствиеОбъектов = Истина;
		ДокументОбъект = СоздатьНовыйОбъектПоТипу(ИмяТипаПриемника);
	Иначе
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьДокументДаннымиИзРозницы(ДокументОбъект, Данные); 
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект, , Истина); //удалять нельзя
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если ДобавитьВСоответствиеОбъектов Тогда
		ЗаписатьВРегистрСоответствияОбъектов(ДокументОбъект.Ссылка, Данные.guid, ИмяТипаПриемника);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("success", Истина);
	Результат.Вставить("created", ДобавитьВСоответствиеОбъектов);
	Результат.Вставить("document_ref", Строка(ДокументОбъект.Ссылка));
	Результат.Вставить("document_number", ДокументОбъект.Номер);
	Результат.Вставить("message", ?(ДобавитьВСоответствиеОбъектов, "Документ Поступление товаров и услуг создан", "Документ Поступление товаров и услуг обновлен"));
	Результат.Вставить("ref", ПолучитьНавигационнуюСсылку(ДокументОбъект.Ссылка));
	Возврат Результат;
	
КонецФункции

Функция СоздатьСчетНаОплатуПоставщикаИзРозницы(Данные)
	ИмяТипаПриемника = "ДокументСсылка.СчетНаОплатуПоставщика";
	ДокументСсылка = НайтиПоСсылкеВДругойБазе(Данные.guid, ИмяТипаПриемника);
	ДобавитьВСоответствиеОбъектов = Ложь;
	
	Если ДокументСсылка = ПолучитьПустуюСсылкуПоТипу(ИмяТипаПриемника) Тогда
		ДобавитьВСоответствиеОбъектов = Истина;
		ДокументОбъект = СоздатьНовыйОбъектПоТипу(ИмяТипаПриемника);
	Иначе
		ДокументОбъект = ДокументСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	ЗаполнитьСчетНаОплатуПоставщикаДаннымиИзРозницы(ДокументОбъект, Данные); 
	
	ЗаполнениеДокументов.Заполнить(ДокументОбъект); //удалять нельзя
	
	ДокументОбъект.Записать(РежимЗаписиДокумента.Запись);
	
	Если ДобавитьВСоответствиеОбъектов Тогда
		ЗаписатьВРегистрСоответствияОбъектов(ДокументОбъект.Ссылка, Данные.guid, ИмяТипаПриемника);
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("success", Истина);
	Результат.Вставить("created", ДобавитьВСоответствиеОбъектов);
	Результат.Вставить("document_ref", Строка(ДокументОбъект.Ссылка));
	Результат.Вставить("document_number", ДокументОбъект.Номер);
	Результат.Вставить("message", ?(ДобавитьВСоответствиеОбъектов, "Документ Счет на оплату поставщика создан", "Документ Поступление товаров и услуг обновлен"));
	Результат.Вставить("ref", ПолучитьНавигационнуюСсылку(ДокументОбъект.Ссылка));
	Возврат Результат;
	
КонецФункции


#КонецОбласти

Функция ПолучитьПакетHTTPS(ПараметрыПодключения) 
	
	HTTPСоединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера, 443, , , Новый ИнтернетПрокси(Ложь), 30,
		Новый ЗащищенноеСоединениеOpenSSL);

	HTTPЗапрос = Новый HTTPЗапрос(ПараметрыПодключения.ПутьСервиса);
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить("X-Base-ID", ПараметрыПодключения.ИДБазы);
	HTTPЗапрос.Заголовки.Вставить("X-API-Key", ПараметрыПодключения.APIkey);
	
	Попытка
		HTTPОтвет = HTTPСоединение.ВызватьHTTPМетод("GET", HTTPЗапрос);
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
		КодОтвета = HTTPОтвет.КодСостояния;
		
		Возврат Новый Структура("КодОтвета, ТелоОтвета", КодОтвета, ТелоОтвета);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка отправки запроса: " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат Новый Структура("КодОтвета, ТелоОтвета", 555, ОписаниеОшибки());
	КонецПопытки;
	
КонецФункции


Процедура УдалитьНоменклатуруИзОчереди(МассивНоменклатуры)

	Для Каждого СсылкаНаНоменклатуру Из МассивНоменклатуры Цикл
		МЗ = РегистрыСведений.МС_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
		МЗ.Ссылка = СсылкаНаНоменклатуру;
		Если МЗ.Прочитать() Тогда
			МЗ.Удалить();
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ОтправитьJSONВДругуюБазу(СтрокаJSON)
	
	АдресСервера = СокрЛП(Строка(Константы.МС_Адрес.Получить()));
	Порт = Константы.МС_Порт.Получить();
	Пользователь = СокрЛП(Строка(Константы.МС_Пользователь.Получить()));
	Пароль = Строка(Константы.МС_Пароль.Получить());
	
	ПутьHTTPСервиса = СокрЛП(Строка(Константы.МС_ПутьHTTPСервиса.Получить()));
	
	ПутьHTTPСервиса = СтрШаблон("%1%2", ПутьHTTPСервиса, "/incoming_nomenklatura");
	
	Таймаут = Константы.МС_ТаймаутHTTP.Получить();
	
	Если ПустаяСтрока(АдресСервера) Или ПустаяСтрока(ПутьHTTPСервиса) Тогда
		ВызватьИсключение "Не заполнены настройки обмена с БП (адрес/путь HTTP-сервиса).";
	КонецЕсли;
	
	Если Порт = Неопределено Или Порт = 0 Тогда
		Порт = 80;
	КонецЕсли;
	
	Если Таймаут = Неопределено Или Таймаут <= 0 Тогда
		Таймаут = 60;
	КонецЕсли;
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			АдресСервера,
			80,
			Пользователь,
			Пароль,
			,
			Таймаут,
			
		);
	
		Запрос = Новый HTTPЗапрос(ПутьHTTPСервиса);
		Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		Запрос.Заголовки.Вставить("Accept", "application/json");
		Запрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
		ТелоОтвета = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	
		Если Ответ.КодСостояния = 200 Тогда
		//@skip-check undefined-variable
		//ОтветСтруктура = МС_ВыгрузкаСервер.ПрочитатьJSONИзСтроки(ТелоОтвета);
		
			//Текст = СтрШаблон("Документ успешно загружен в бухгалтерию: %1", ОтветСтруктура.document_ref);
			
			Текст = "Данные загружены";
			
			//@skip-check undefined-variable
			ОбщегоНазначения.СообщитьПользователю(Текст);
			
			//@skip-check undefined-variable
			//ОбщегоНазначения.СообщитьПользователю(ОтветСтруктура.ref);
			
			//@skip-check undefined-variable
//			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
//				"МС_ОбменРозницаБП",
//				УровеньЖурналаРегистрации.Информация,
//				,
//				,
//				"Успешная выгрузка в БП (GUID=" + GUIDДокументаИсточник + ", БП.Ссылка=" + Строка(ОтветСтруктура.document_ref) + ")."
//			);
		Иначе
		
			ВызватьИсключение 
				"Ошибка HTTP при выгрузке. Код: "
				+ Строка(Ответ.КодСостояния)
				+ ". Ответ: "
				+ ТелоОтвета;
			
		КонецЕсли;
	
		Возврат Ответ.КодСостояния;
		
	Исключение
		
		ТекстОшибки = "Ошибка обмена";
//		Если Не ПустаяСтрока(GUIDДокументаИсточник) Тогда
//			ТекстОшибки = ТекстОшибки + " (GUID=" + GUIDДокументаИсточник + ")";
//		КонецЕсли;
		ТекстОшибки = ТекстОшибки + ": " + ОписаниеОшибки();
		
		//@skip-check undefined-variable
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(
			"МС_Обмен",
			УровеньЖурналаРегистрации.Ошибка,
			,
			,
			ТекстОшибки
		);
		
		ВызватьИсключение ТекстОшибки;
		
	КонецПопытки;
	
КонецФункции


Процедура ОтправитьНоменклатуруВОчередьНаВыгрузку(Ссылка)
	МенеджерЗаписи = РегистрыСведений.МС_ОчередьВыгрузки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Ссылка = Ссылка;
	МенеджерЗаписи.Записать();
КонецПроцедуры

Процедура АктуализироватьРегистрНаименованиеНоменклатуры(Выборка)
	МенеджерЗаписи = РегистрыСведений.МС_НаименованиеНоменклатуры.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Выборка.Ссылка;
	МенеджерЗаписи.Наименование = Выборка.НовоеНаименование;
	МенеджерЗаписи.НаименованиеПолное = Выборка.НовоеНаименованиеПолное;
	МенеджерЗаписи.Записать();
КонецПроцедуры

#Область ВыгрузкаНоменклатуры

Функция СформироватьJSONПоВсейНоменклатуре() Экспорт

	ТаблицаНоменклатуры = ПолучитьТаблицуВсейНоменклатуры();

	Возврат СформироватьJSONПоТаблицеНоменклатуры(ТаблицаНоменклатуры);

КонецФункции


Функция СформироватьJSONПоМассивуСсылок(Знач МассивСсылок) Экспорт

	МассивСсылокДляЗапроса = НормализоватьМассивСсылокНоменклатуры(МассивСсылок);

	Если МассивСсылокДляЗапроса.Количество() = 0 Тогда
		Возврат "[]";
	КонецЕсли;

	ТаблицаНоменклатуры = ПолучитьВсехРодителейИПотомковСИерархией(МассивСсылокДляЗапроса);

	Возврат СформироватьJSONПоТаблицеНоменклатуры(ТаблицаНоменклатуры);

КонецФункции


Функция СформироватьJSONПоТаблицеНоменклатуры(ТаблицаНоменклатуры)

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписьJSON.ЗаписатьНачалоМассива();

	КорневыеЭлементы = ПостроитьИерархию(ТаблицаНоменклатуры);

	Для Каждого Элемент Из КорневыеЭлементы Цикл
		ВыгрузитьЭлементВJSON(ЗаписьJSON, Элемент);
	КонецЦикла;

	ЗаписьJSON.ЗаписатьКонецМассива();
	
	
	Возврат ЗаписьJSON.Закрыть();

КонецФункции


Функция ПолучитьТаблицуВсейНоменклатуры()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Родитель,
		|	Номенклатура.ЭтоГруппа УБЫВ,
		|	Номенклатура.Наименование";

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции


Функция ПолучитьТаблицуНоменклатурыПоСсылкам(МассивСсылок)

	Если МассивСсылок.Количество() = 0 Тогда
		Возврат СоздатьПустуюТаблицуНоменклатуры();
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	Номенклатура.Родитель КАК Родитель,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В (&МассивСсылок)
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Родитель,
		|	Номенклатура.ЭтоГруппа УБЫВ,
		|	Номенклатура.Наименование";

	Запрос.УстановитьПараметр("МассивСсылок", МассивСсылок);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции


Функция ПолучитьВсехРодителейИПотомковСИерархией(МассивСсылок)

	МассивСсылокРезультат = Новый Массив;
	ИндексСсылок = Новый Соответствие;

	Для Каждого Ссылка Из МассивСсылок Цикл
		ДобавитьСсылкуЕслиНовая(МассивСсылокРезультат, ИндексСсылок, Ссылка);
	КонецЦикла;

	МассивСсылокРезультат = ПолучитьВсехРодителей(
		МассивСсылок,
		МассивСсылокРезультат,
		ИндексСсылок
	);

	МассивСсылокРезультат = ПолучитьВсехПотомков(
		МассивСсылок,
		МассивСсылокРезультат,
		ИндексСсылок
	);

	Возврат ПолучитьТаблицуНоменклатурыПоСсылкам(МассивСсылокРезультат);

КонецФункции


Функция ПолучитьВсехРодителей(МассивСсылокДляПоиска, ТекущийМассив, ИндексСсылок)

	НаборДляПоиска = МассивСсылокДляПоиска;
	ЕстьНовыеСсылки = Истина;

	Пока ЕстьНовыеСсылки Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Номенклатура.Родитель КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Ссылка В (&МассивСсылок)
			|	И Номенклатура.Родитель <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";

		Запрос.УстановитьПараметр("МассивСсылок", НаборДляПоиска);

		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

		НовыеСсылки = Новый Массив;

		Для Каждого Строка Из РезультатЗапроса Цикл

			Если ДобавитьСсылкуЕслиНовая(ТекущийМассив, ИндексСсылок, Строка.Ссылка) Тогда
				НовыеСсылки.Добавить(Строка.Ссылка);
			КонецЕсли;

		КонецЦикла;

		НаборДляПоиска = НовыеСсылки;
		ЕстьНовыеСсылки = НовыеСсылки.Количество() > 0;

	КонецЦикла;

	Возврат ТекущийМассив;

КонецФункции


Функция ПолучитьВсехПотомков(МассивСсылокДляПоиска, ТекущийМассив, ИндексСсылок)

	НаборРодителей = МассивСсылокДляПоиска;
	ЕстьНовыеСсылки = Истина;

	Пока ЕстьНовыеСсылки Цикл

		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Номенклатура.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	Номенклатура.Родитель В (&МассивСсылок)";

		Запрос.УстановитьПараметр("МассивСсылок", НаборРодителей);

		//@skip-check query-in-loop
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();

		НовыеСсылки = Новый Массив;

		Для Каждого Строка Из РезультатЗапроса Цикл

			Если ДобавитьСсылкуЕслиНовая(ТекущийМассив, ИндексСсылок, Строка.Ссылка) Тогда
				НовыеСсылки.Добавить(Строка.Ссылка);
			КонецЕсли;

		КонецЦикла;

		НаборРодителей = НовыеСсылки;
		ЕстьНовыеСсылки = НовыеСсылки.Количество() > 0;

	КонецЦикла;

	Возврат ТекущийМассив;

КонецФункции


Функция ПостроитьИерархию(ТаблицаЭлементов)

	ЭлементыПоСсылкам = Новый Соответствие;
	РодителиПоСсылкам = Новый Соответствие;
	КорневыеЭлементы = Новый Массив;

	Для Каждого СтрокаНоменклатуры Из ТаблицаЭлементов Цикл

		Элемент = Новый Структура;
		Элемент.Вставить("Ссылка", СтрокаНоменклатуры.Ссылка);
		Элемент.Вставить("Родитель", СтрокаНоменклатуры.Родитель);
		Элемент.Вставить("Наименование", СтрокаНоменклатуры.Наименование);
		Элемент.Вставить("НаименованиеПолное", СтрокаНоменклатуры.НаименованиеПолное);
		Элемент.Вставить("ЭтоГруппа", СтрокаНоменклатуры.ЭтоГруппа);
		Элемент.Вставить("Дети", Новый Массив);

		ЭлементыПоСсылкам.Вставить(СтрокаНоменклатуры.Ссылка, Элемент);
		РодителиПоСсылкам.Вставить(СтрокаНоменклатуры.Ссылка, СтрокаНоменклатуры.Родитель);

	КонецЦикла;

	Для Каждого СтрокаНоменклатуры Из ТаблицаЭлементов Цикл

		Элемент = ЭлементыПоСсылкам.Получить(СтрокаНоменклатуры.Ссылка);
		Родитель = РодителиПоСсылкам.Получить(СтрокаНоменклатуры.Ссылка);

		Если Родитель.Пустая() Тогда

			КорневыеЭлементы.Добавить(Элемент);

		Иначе

			РодительЭлемент = ЭлементыПоСсылкам.Получить(Родитель);

			Если РодительЭлемент = Неопределено Тогда
				КорневыеЭлементы.Добавить(Элемент);
			Иначе
				РодительЭлемент.Дети.Добавить(Элемент);
			КонецЕсли;

		КонецЕсли;

	КонецЦикла;

	Возврат КорневыеЭлементы;

КонецФункции


Процедура ВыгрузитьЭлементВJSON(ЗаписьJSON, Элемент)

	ЗаписьJSON.ЗаписатьНачалоОбъекта();

	ЗаписьJSON.ЗаписатьИмяСвойства("Гуид");
	ЗаписьJSON.ЗаписатьЗначение(Строка(Элемент.Ссылка.УникальныйИдентификатор()));

	ЗаписьJSON.ЗаписатьИмяСвойства("РодительГуид");

	Если Элемент.Родитель.Пустая() Тогда
		ЗаписьJSON.ЗаписатьЗначение("");
	Иначе
		ЗаписьJSON.ЗаписатьЗначение(Строка(Элемент.Родитель.УникальныйИдентификатор()));
	КонецЕсли;

	ЗаписьJSON.ЗаписатьИмяСвойства("Наименование");
	ЗаписьJSON.ЗаписатьЗначение(ПолучитьСтрокуДляJSON(Элемент.Наименование));

	ЗаписьJSON.ЗаписатьИмяСвойства("НаименованиеПолное");
	ЗаписьJSON.ЗаписатьЗначение(ПолучитьСтрокуДляJSON(Элемент.НаименованиеПолное));

	ЗаписьJSON.ЗаписатьИмяСвойства("ЭтоГруппа");
	ЗаписьJSON.ЗаписатьЗначение(Элемент.ЭтоГруппа);

	Если Элемент.Дети.Количество() > 0 Тогда

		ЗаписьJSON.ЗаписатьИмяСвойства("Дети");
		ЗаписьJSON.ЗаписатьНачалоМассива();

		Для Каждого ДочернийЭлемент Из Элемент.Дети Цикл
			ВыгрузитьЭлементВJSON(ЗаписьJSON, ДочернийЭлемент);
		КонецЦикла;

		ЗаписьJSON.ЗаписатьКонецМассива();

	КонецЕсли;

	ЗаписьJSON.ЗаписатьКонецОбъекта();

КонецПроцедуры


Функция ПолучитьСтрокуДляJSON(Значение)

	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Возврат Строка(Значение);

КонецФункции


Функция НормализоватьМассивСсылокНоменклатуры(МассивСсылок)

	Результат = Новый Массив;
	ИндексСсылок = Новый Соответствие;

	Если МассивСсылок = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Для Каждого ЗначениеСсылки Из МассивСсылок Цикл

		СсылкаНоменклатуры = ПреобразоватьЗначениеВСсылкуНоменклатуры(ЗначениеСсылки);

		Если СсылкаНоменклатуры <> Неопределено И Не СсылкаНоменклатуры.Пустая() Тогда
			ДобавитьСсылкуЕслиНовая(Результат, ИндексСсылок, СсылкаНоменклатуры);
		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции


Функция ПреобразоватьЗначениеВСсылкуНоменклатуры(ЗначениеСсылки)

	Если ТипЗнч(ЗначениеСсылки) = Тип("СправочникСсылка.Номенклатура") Тогда
		Возврат ЗначениеСсылки;
	ИначеЕсли ТипЗнч(ЗначениеСсылки) = Тип("Строка") Тогда
		Возврат ПолучитьСсылкуНоменклатурыИзСтроки(ЗначениеСсылки);
	ИначеЕсли ТипЗнч(ЗначениеСсылки) = Тип("УникальныйИдентификатор") Тогда
		Возврат ПолучитьСсылкуНоменклатурыИзGUID(ЗначениеСсылки);
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции


Функция ПолучитьСсылкуНоменклатурыИзСтроки(СтрокаGUID)

	СтрокаGUID = СокрЛП(СтрокаGUID);

	Если СтрокаGUID = "" Тогда
		Возврат Неопределено;
	КонецЕсли;

	Попытка
		Возврат Справочники.Номенклатура.ПолучитьСсылку(Новый УникальныйИдентификатор(СтрокаGUID));
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции


Функция ПолучитьСсылкуНоменклатурыИзGUID(GUID)

	Попытка
		Возврат Справочники.Номенклатура.ПолучитьСсылку(GUID);
	Исключение
		Возврат Неопределено;
	КонецПопытки;

КонецФункции


Функция ДобавитьСсылкуЕслиНовая(МассивСсылок, ИндексСсылок, Ссылка)

	Если Ссылка = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;

	Если ИндексСсылок.Получить(Ссылка) = Неопределено Тогда

		ИндексСсылок.Вставить(Ссылка, Истина);
		МассивСсылок.Добавить(Ссылка);

		Возврат Истина;

	КонецЕсли;

	Возврат Ложь;

КонецФункции


Функция СоздатьПустуюТаблицуНоменклатуры()

	Таблица = Новый ТаблицаЗначений;

	Таблица.Колонки.Добавить("Ссылка");
	Таблица.Колонки.Добавить("Наименование");
	Таблица.Колонки.Добавить("НаименованиеПолное");
	Таблица.Колонки.Добавить("Родитель");
	Таблица.Колонки.Добавить("ЭтоГруппа");

	Возврат Таблица;

КонецФункции

#КонецОбласти


#КонецОбласти
